import numpy as np
print(np.__version__) # 1.20.3


a1=np.array([[1,2],[3,4],[5,6]])              #(3,2) 2개짜리가 3개
a2=np.array([[1,2,3],[4,5,6]])                #(2,3) 3개짜리가 2개
a3=np.array([[[1],[2],[3]],[[4],[5],[6]]])    #(2,3,1) 1개짜리가 3묶음, 그 묶음이 2개
a4=np.array([[[1,2],[3,4]],[[5,6],[7,8]]])            #(2,2,2) 2개짜리가 2묶음, 그 묶음이 2개
a5=np.array([[[1,2,3]],[[4,5,6]]])            #(2,1,3) 3개짜리가 1묶음, 그 묶음이 2개
a6=np.array([1,2,3,4,5,6])                    #(6, ) 
a7=np.array([[1,2,3],[4,5,6],[7,8,9],[10,11,12]]) #(4,3) 3개짜리가 4묶음


print(a1.shape) # (3, 2)
print(a2.shape) # (2, 3)
print(a3.shape) # (2, 3, 1)
print(a4.shape) # (2, 2, 2)
print(a5.shape) # (2, 1, 3)
print(a6.shape) # (6,)
print(a7.shape) # (4, 3)

